kayrozen/ESP-adf-streamer/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# CPU frequency — 240 MHz (default is 160 MHz).
#
# Log 26 root cause: steady-state HTTP throughput was stuck at ~9.2 KB/s
# (= 108 KB/s PCM) regardless of WiFi power-save config (PS_NONE in log 24
# and PS_MIN_MODEM+li=1 in log 26 measured identically). That rules out the
# network/WiFi path as the steady-state bottleneck. The boot log showed
# "cpu freq: 160000000 Hz" and the monitor's CPU runtime-stats table failed
# to render. The pipeline runs MP3 decode + SBC encode (a2dp_stream) + BT/WiFi
# coexistence concurrently; at 160 MHz the MP3 decoder can only produce ~108
# KB/s of PCM, below the 192 KB/s real-time rate for 48kHz/stereo/16-bit, so
# the A2DP sink underruns continuously -> choppy audio. BT airtime is not the
# limit (~25 KB/s of SBC over a >1 Mbps link is trivial); CPU throughput is.
# 240 MHz gives 50% more compute (~9.2 -> ~13.8 KB/s), which combined with the
# existing PSRAM jitter buffers should clear real-time.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# PSRAM — WROVER-B cache fix (mfix-esp32-psram-cache-issue equivalent)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_CACHE_WORKAROUND=y
CONFIG_SPIRAM_CACHE_LIBJMP_IN_IRAM=y
CONFIG_SPIRAM_CACHE_LIBMATH_IN_IRAM=y
CONFIG_SPIRAM_CACHE_LIBNUMPARSER_IN_IRAM=y
CONFIG_SPIRAM_CACHE_LIBIO_IN_IRAM=y
CONFIG_SPIRAM_CACHE_LIBTIME_IN_IRAM=y
CONFIG_SPIRAM_CACHE_LIBCHAR_IN_IRAM=y
CONFIG_SPIRAM_CACHE_LIBMEM_IN_IRAM=y
CONFIG_SPIRAM_CACHE_LIBSTR_IN_IRAM=y
CONFIG_SPIRAM_CACHE_LIBRAND_IN_IRAM=y
CONFIG_SPIRAM_CACHE_LIBEVENT_IN_IRAM=y
CONFIG_SPIRAM_CACHE_LIBSOCKET_IN_IRAM=y

# Flash size 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Bluetooth — classic BT only (no BLE needed for A2DP)
CONFIG_BT_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_SPP_ENABLED=n
CONFIG_BT_HFP_ENABLE=n
CONFIG_BT_BLE_ENABLED=n
CONFIG_BT_STACK_NO_LOG=n
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=n
# Controller memory for Classic BT
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y

# WiFi — PSRAM forces STATIC TX buffers, so shrink the static pool instead.
#
# The trap that bit logs 18 AND 20: we tried to switch TX to dynamic to free
# internal DRAM, but ESP-IDF v5.3.1 gates dynamic TX behind
#     config ESP_WIFI_DYNAMIC_TX_BUFFER
#         depends on !SPIRAM_USE_MALLOC
# and we run CONFIG_SPIRAM_USE_MALLOC=y. So CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
# is silently dropped (unmet dependency) and the choice falls back to STATIC 16
# = 25.6KB of internal DRAM pinned at wifi init — exactly what every log kept
# showing ("Init static tx buffer num: 16"), even though CI builds clean. The
# IDF help confirms it: "If PSRAM is enabled, Static should be selected."
#
# Dynamic is therefore off the table. Free DRAM by cutting the STATIC TX pool
# from 16 to 6. We receive audio (HTTP GET); TX is only TCP ACKs (~40B), so 6
# buffers is ample. 6 × 1.6KB = 9.6KB vs 16 × 1.6KB = 25.6KB → frees ~16KB of
# internal DRAM, lifting the streaming-phase floor from ~26KB (where log 20
# crashed in lwIP after ~1s of audio) to ~42KB.
#
# Static RX kept at 8 — these hold inbound audio frames; dropping them risks
# losing data under BT/WiFi coexistence.
#
# If "wifi:m f null" becomes frequent under load, bump STATIC_TX_BUFFER_NUM
# back toward 8–10 (trading some reclaimed DRAM for TX headroom).
#
# VERIFY in the next log: wifi init must read "Init static tx buffer num: 6"
# and "monitor: HEAP@start internal: ~42 KB" (was 26 KB).
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# lwIP — TCP receive window and send buffer.
#
# MSS = 1440 bytes. Window must be >= 2*MSS (2880) to keep lwIP's
# "ACK every 2nd segment" fast path. Below 2*MSS every ACK waits for the
# 200ms delayed-ACK timer, capping throughput near 14KB/s.
#
# History: log 21 (li=3, 307ms modem sleep) had ACKs delayed 300-1600ms, so
# PR #18 raised the window to 8*MSS=11520 to push a big burst before each
# stall. That was correct WHEN WIFI WAS THE BOTTLENECK.
#
# Log 27/28 changed the regime. With 240 MHz + the decoder on Core 1 (PR #22)
# the CPU is no longer the limit: the startup burst fills the buffers at
# 20+ KiB/s. Steady-state then SETTLES to ~12 KiB/s (79% of the 15.6 KiB/s
# real-time rate) — not because WiFi is starved, but because the A2DP TX path
# back-pressures it: the BT->speaker L2CAP channel congests
# ("BT_L2CAP: l2cab is_cong_cback_context" in bursts), the 256KB PCM ring
# fills, http_stream blocks, and WiFi idles down to match BT's drain. The
# speaker underruns -> choppy. Internal DRAM also bottoms out at 6 KB min-ever.
#
# The 8*MSS window is now actively harmful: (a) it lets the server send long
# contiguous bursts, so WiFi holds the radio for long stretches during each
# 102ms (li=1) wake and starves BT of the airtime it needs to drain SBC; and
# (b) when http_stream stalls under back-pressure, lwIP holds up to ~11.5KB of
# RX pbufs in internal DRAM, driving the heap floor down to where the BT
# controller's DMA-capable ACL TX buffers fail to allocate -> more congestion.
# (The earlier note that the window costs ~no internal DRAM was wrong: pbufs
# for received-but-undrained data ARE held in internal DRAM until the app
# reads them, and a stalled consumer pins up to a full window's worth.)
#
# Fix: drop to 4*MSS=5760. This keeps the >=2*MSS fast-ACK path (no delayed-ACK
# stall — li=1 already gives prompt 102ms ACKs and the icecast RTT is low, so
# 4*MSS sustains far more than the 15.6 KiB/s needed), while halving the
# worst-case pbuf buffering (frees internal DRAM, lifts the heap floor) and
# shortening WiFi's radio bursts so BT A2DP gets airtime more regularly.
#
# VERIFY in the next log: fewer/no "BT_L2CAP: l2cab is_cong" bursts, internal
# min-ever heap above ~12 KB, and steady-state HTTP pos rate >= 15.6 KiB/s.
#
# SND_BUF (send side) stays at 2880: we're a receiver (HTTP GET), so
# outbound data is only TCP ACKs (~40B each); a smaller send buffer is fine.
#
# Pin MSS=1440 explicitly so the window stays exactly 4*MSS. The IDF v5.3.1
# default already resolves to 1440 (confirmed by "tcp mss: 1440" in the logs),
# but defining it here keeps the 4*MSS relationship robust if the default ever
# drifts — otherwise a changed MSS would silently break the >=2*MSS fast-ACK
# alignment this window size depends on.
CONFIG_LWIP_TCP_MSS=1440
CONFIG_LWIP_TCP_WND_DEFAULT=5760
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=2880

# Audio pipeline — allow element task stacks to be allocated in PSRAM.
# Without this, BT+WiFi exhaust internal DRAM and audio thread creation fails.
# NOTE: xTaskCreateStaticPinnedToCore + PSRAM stack is broken in ADF v2.8 +
# IDF v5.3.1 (returns NULL with 40 KB internal free). Disable to fall back to
# xTaskCreatePinnedToCore. With this disabled, all task stacks are allocated
# strictly in internal DRAM (SPIRAM_USE_MALLOC does NOT overflow stacks to PSRAM).
# Ring buffer reductions (decoder 8KB, passthrough 4KB) free enough internal
# DRAM for the audio task stacks to fit.
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=n
CONFIG_AUDIO_ELEMENT_TASK_STACK_SIZE=3584

# Larger HTTP buffer for HLS segments
CONFIG_HTTP_STREAM_TASK_STACK_SIZE=6144

# Logging
CONFIG_LOG_DEFAULT_LEVEL_DEBUG=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y

# FreeRTOS runtime stats (needed for CPU monitoring in Phase C)
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y
# ADF v2.8 audio_hal.h uses xSemaphoreHandle (pre-FreeRTOS-v8 typedef)
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# Watchdog — extend for debug builds
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# NVS encryption off for prototype
CONFIG_NVS_ENCRYPTION=n

# MBEDTLS for HTTPS streams
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# TLS — skip server certificate verification (prototype only).
#
# ESP-IDF v5.3.1 added a strict check in esp_mbedtls_set_client_config():
# if none of {cacert_buf, crt_bundle_attach, use_global_ca_store,
# skip_server_cert_verify} is set, the TLS setup returns
# ESP_ERR_MBEDTLS_SSL_SETUP_FAILED ("No server verification option set").
#
# ESP-ADF v2.8's http_stream.c was released before this check existed and
# does NOT set crt_bundle_attach on its internal esp_http_client_config_t,
# so every https:// URL (AAC Icecast, HLS Radio France, BBC HLS) hit this
# error immediately after the station switch, producing:
#   E esp-tls-mbedtls: No server verification option set … [0x8017]
# and aborting the stream (observed in logs 41/42 at the first MP3→AAC
# switch 30 s into Phase D rotation).
#
# CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY makes skip_server_cert_verify=true
# the default, which satisfies the check without requiring cert data.
# CONFIG_ESP_TLS_INSECURE must be enabled first (it gates the skip option).
# The cert bundle symbols above are kept so they can be wired in properly
# when productising (replace skip with crt_bundle_attach in http_stream).
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

# Phase D — station rotation: cycle MP3 -> AAC -> HLS mono -> HLS multi every
# 30 s without dropping the A2DP link. Exercises the decoder hot-swap
# (MP3<->AAC) and the HTTPS/TLS + HLS-playlist paths that the plaintext MP3
# baseline never touched.
#
# NOTE: this option is defined in main/Kconfig.projbuild (a COMPONENT dir).
# ESP-IDF only scans Kconfig.projbuild inside components, never the project
# root — a root-level Kconfig.projbuild is silently ignored, which is why the
# first Phase D enable (PR #28) had no effect.
CONFIG_PROTOTYPE_PHASE_D_ROTATION=y
